tap "homebrew/bundle"
tap "homebrew/services", "https://mirrors.ustc.edu.cn/homebrew-services.git"
tap "ngrok/ngrok"
tap "rcmdnk/file"
brew "giflib"
brew "autojump"
brew "cairo"
brew "cowsay"
brew "gh"
brew "pango"
brew "git"
brew "git-lfs"
brew "jpeg"
brew "jq"
brew "librsvg"
brew "pipx"
brew "pkgconf"
brew "python-setuptools"
brew "trash", link: true
brew "tree"
brew "zbar"
brew "rcmdnk/file/brew-file"
cask "chromium"
cask "ngrok"
cask "shortcutdetective"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "amour1688.ts-in-markdown"
vscode "angeloperera.vscode-open-in-fork"
vscode "antfu.browse-lite"
vscode "antfu.file-nesting"
vscode "antfu.icons-carbon"
vscode "antfu.slidev"
vscode "antfu.smart-clicks"
vscode "antfu.theme-vitesse"
vscode "aykutsarac.jsoncrack-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "clinyong.vscode-css-modules"
vscode "cstuder.gitlab-ci-validator"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "intellsmi.comment-translate"
vscode "jock.svg"
vscode "lokalise.i18n-ally"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zihanli.at-helper"
